* org-mode for interactively deleting jobs

You need this in your init.el file to avoid the yes-no message box for each click.

(setq org-confirm-shell-link-function nil)

#+BEGIN_SRC python :results org raw

import commands

out = commands.getoutput('qstat').split('\n')

for line in out[2:]:
    jobid, name, user, time, status, queue = line.split()

    qdel = '[[shell:qdel {0}][qdel]]'.format(jobid)
    
    if user != 'jkitchin' or status == 'C': continue

    print '|' + '|'.join([jobid, name, user, time, status, queue, qdel]) + '|'

#+END_SRC

#+RESULTS:


** using python-torque

#+BEGIN_SRC python :results org raw

from torque.torque import *

PBS = PBS()
PBS.fastpoll()

print '\n'.join(['|{x[Job Id]}|{x[job_state]}|[[shell:qdel {x[Job Id]}]]|'.format(x=job)
 for job in PBS if job['euser'] == 'jboes'])
#+END_SRC

#+RESULTS:
| 881248.gilgamesh | R | [[shell:qdel 881248.gilgamesh]] |
| 881249.gilgamesh | R | [[shell:qdel 881249.gilgamesh]] |
| 881250.gilgamesh | R | [[shell:qdel 881250.gilgamesh]] |
| 881251.gilgamesh | R | [[shell:qdel 881251.gilgamesh]] |
| 881252.gilgamesh | R | [[shell:qdel 881252.gilgamesh]] |
| 881253.gilgamesh | R | [[shell:qdel 881253.gilgamesh]] |
| 881254.gilgamesh | R | [[shell:qdel 881254.gilgamesh]] |
| 881255.gilgamesh | R | [[shell:qdel 881255.gilgamesh]] |
| 881256.gilgamesh | R | [[shell:qdel 881256.gilgamesh]] |
| 881257.gilgamesh | R | [[shell:qdel 881257.gilgamesh]] |
| 881258.gilgamesh | R | [[shell:qdel 881258.gilgamesh]] |
| 881259.gilgamesh | R | [[shell:qdel 881259.gilgamesh]] |
| 881260.gilgamesh | R | [[shell:qdel 881260.gilgamesh]] |
| 881261.gilgamesh | R | [[shell:qdel 881261.gilgamesh]] |
| 881262.gilgamesh | R | [[shell:qdel 881262.gilgamesh]] |
| 881263.gilgamesh | R | [[shell:qdel 881263.gilgamesh]] |
| 881264.gilgamesh | R | [[shell:qdel 881264.gilgamesh]] |
| 881265.gilgamesh | R | [[shell:qdel 881265.gilgamesh]] |
| 881266.gilgamesh | R | [[shell:qdel 881266.gilgamesh]] |
| 881267.gilgamesh | R | [[shell:qdel 881267.gilgamesh]] |
| 881414.gilgamesh | R | [[shell:qdel 881414.gilgamesh]] |
| 881416.gilgamesh | R | [[shell:qdel 881416.gilgamesh]] |
| 881418.gilgamesh | R | [[shell:qdel 881418.gilgamesh]] |
| 881420.gilgamesh | R | [[shell:qdel 881420.gilgamesh]] |
| 881422.gilgamesh | R | [[shell:qdel 881422.gilgamesh]] |
| 881424.gilgamesh | R | [[shell:qdel 881424.gilgamesh]] |
| 881426.gilgamesh | R | [[shell:qdel 881426.gilgamesh]] |
| 881428.gilgamesh | R | [[shell:qdel 881428.gilgamesh]] |
| 881430.gilgamesh | R | [[shell:qdel 881430.gilgamesh]] |
| 881432.gilgamesh | R | [[shell:qdel 881432.gilgamesh]] |
| 881434.gilgamesh | R | [[shell:qdel 881434.gilgamesh]] |
| 881436.gilgamesh | R | [[shell:qdel 881436.gilgamesh]] |
| 881438.gilgamesh | R | [[shell:qdel 881438.gilgamesh]] |
| 881440.gilgamesh | R | [[shell:qdel 881440.gilgamesh]] |
| 881442.gilgamesh | R | [[shell:qdel 881442.gilgamesh]] |
| 881444.gilgamesh | R | [[shell:qdel 881444.gilgamesh]] |
| 881446.gilgamesh | R | [[shell:qdel 881446.gilgamesh]] |
| 881448.gilgamesh | R | [[shell:qdel 881448.gilgamesh]] |
| 881450.gilgamesh | R | [[shell:qdel 881450.gilgamesh]] |
| 881452.gilgamesh | R | [[shell:qdel 881452.gilgamesh]] |
| 881454.gilgamesh | R | [[shell:qdel 881454.gilgamesh]] |
| 881456.gilgamesh | R | [[shell:qdel 881456.gilgamesh]] |
| 881458.gilgamesh | R | [[shell:qdel 881458.gilgamesh]] |
| 881460.gilgamesh | R | [[shell:qdel 881460.gilgamesh]] |
| 881462.gilgamesh | R | [[shell:qdel 881462.gilgamesh]] |
| 881464.gilgamesh | R | [[shell:qdel 881464.gilgamesh]] |
| 881466.gilgamesh | R | [[shell:qdel 881466.gilgamesh]] |
| 881468.gilgamesh | R | [[shell:qdel 881468.gilgamesh]] |
| 881470.gilgamesh | R | [[shell:qdel 881470.gilgamesh]] |
| 881472.gilgamesh | R | [[shell:qdel 881472.gilgamesh]] |
| 881474.gilgamesh | R | [[shell:qdel 881474.gilgamesh]] |
| 881476.gilgamesh | R | [[shell:qdel 881476.gilgamesh]] |
| 881478.gilgamesh | R | [[shell:qdel 881478.gilgamesh]] |
| 881480.gilgamesh | R | [[shell:qdel 881480.gilgamesh]] |
| 881482.gilgamesh | R | [[shell:qdel 881482.gilgamesh]] |
| 881484.gilgamesh | R | [[shell:qdel 881484.gilgamesh]] |
| 881486.gilgamesh | R | [[shell:qdel 881486.gilgamesh]] |
| 881488.gilgamesh | R | [[shell:qdel 881488.gilgamesh]] |
| 881490.gilgamesh | R | [[shell:qdel 881490.gilgamesh]] |
| 881492.gilgamesh | R | [[shell:qdel 881492.gilgamesh]] |
| 881494.gilgamesh | R | [[shell:qdel 881494.gilgamesh]] |
| 881496.gilgamesh | R | [[shell:qdel 881496.gilgamesh]] |
| 881498.gilgamesh | R | [[shell:qdel 881498.gilgamesh]] |
| 881500.gilgamesh | R | [[shell:qdel 881500.gilgamesh]] |
| 881502.gilgamesh | R | [[shell:qdel 881502.gilgamesh]] |
| 881504.gilgamesh | R | [[shell:qdel 881504.gilgamesh]] |
| 881506.gilgamesh | R | [[shell:qdel 881506.gilgamesh]] |
| 881508.gilgamesh | R | [[shell:qdel 881508.gilgamesh]] |
| 881510.gilgamesh | R | [[shell:qdel 881510.gilgamesh]] |
| 881512.gilgamesh | R | [[shell:qdel 881512.gilgamesh]] |
| 881811.gilgamesh | R | [[shell:qdel 881811.gilgamesh]] |
| 881861.gilgamesh | R | [[shell:qdel 881861.gilgamesh]] |
| 881862.gilgamesh | R | [[shell:qdel 881862.gilgamesh]] |
| 881863.gilgamesh | R | [[shell:qdel 881863.gilgamesh]] |
| 881864.gilgamesh | R | [[shell:qdel 881864.gilgamesh]] |
| 881865.gilgamesh | R | [[shell:qdel 881865.gilgamesh]] |
| 881866.gilgamesh | R | [[shell:qdel 881866.gilgamesh]] |
| 881867.gilgamesh | R | [[shell:qdel 881867.gilgamesh]] |
| 881868.gilgamesh | R | [[shell:qdel 881868.gilgamesh]] |
| 881869.gilgamesh | R | [[shell:qdel 881869.gilgamesh]] |
| 881870.gilgamesh | R | [[shell:qdel 881870.gilgamesh]] |
| 881871.gilgamesh | R | [[shell:qdel 881871.gilgamesh]] |
| 881872.gilgamesh | R | [[shell:qdel 881872.gilgamesh]] |
| 881873.gilgamesh | R | [[shell:qdel 881873.gilgamesh]] |
| 881874.gilgamesh | R | [[shell:qdel 881874.gilgamesh]] |
| 881875.gilgamesh | R | [[shell:qdel 881875.gilgamesh]] |
| 881876.gilgamesh | R | [[shell:qdel 881876.gilgamesh]] |
| 881877.gilgamesh | R | [[shell:qdel 881877.gilgamesh]] |
| 881878.gilgamesh | R | [[shell:qdel 881878.gilgamesh]] |
| 881879.gilgamesh | R | [[shell:qdel 881879.gilgamesh]] |
| 881880.gilgamesh | R | [[shell:qdel 881880.gilgamesh]] |
| 881881.gilgamesh | R | [[shell:qdel 881881.gilgamesh]] |
| 881882.gilgamesh | R | [[shell:qdel 881882.gilgamesh]] |
| 881883.gilgamesh | R | [[shell:qdel 881883.gilgamesh]] |
| 881884.gilgamesh | R | [[shell:qdel 881884.gilgamesh]] |
| 881885.gilgamesh | R | [[shell:qdel 881885.gilgamesh]] |
| 881886.gilgamesh | R | [[shell:qdel 881886.gilgamesh]] |
| 881887.gilgamesh | R | [[shell:qdel 881887.gilgamesh]] |
| 881888.gilgamesh | R | [[shell:qdel 881888.gilgamesh]] |
| 881889.gilgamesh | R | [[shell:qdel 881889.gilgamesh]] |
| 881890.gilgamesh | R | [[shell:qdel 881890.gilgamesh]] |
| 881891.gilgamesh | R | [[shell:qdel 881891.gilgamesh]] |
| 881892.gilgamesh | R | [[shell:qdel 881892.gilgamesh]] |
| 881893.gilgamesh | R | [[shell:qdel 881893.gilgamesh]] |
| 881894.gilgamesh | R | [[shell:qdel 881894.gilgamesh]] |
| 881895.gilgamesh | R | [[shell:qdel 881895.gilgamesh]] |
| 881896.gilgamesh | R | [[shell:qdel 881896.gilgamesh]] |
| 881897.gilgamesh | R | [[shell:qdel 881897.gilgamesh]] |
| 881898.gilgamesh | R | [[shell:qdel 881898.gilgamesh]] |
| 881899.gilgamesh | R | [[shell:qdel 881899.gilgamesh]] |
| 881900.gilgamesh | R | [[shell:qdel 881900.gilgamesh]] |
| 881901.gilgamesh | R | [[shell:qdel 881901.gilgamesh]] |
| 881902.gilgamesh | R | [[shell:qdel 881902.gilgamesh]] |
| 881903.gilgamesh | R | [[shell:qdel 881903.gilgamesh]] |
| 881904.gilgamesh | R | [[shell:qdel 881904.gilgamesh]] |
| 881905.gilgamesh | R | [[shell:qdel 881905.gilgamesh]] |
| 881906.gilgamesh | R | [[shell:qdel 881906.gilgamesh]] |
| 881907.gilgamesh | R | [[shell:qdel 881907.gilgamesh]] |
| 881908.gilgamesh | R | [[shell:qdel 881908.gilgamesh]] |
| 881909.gilgamesh | R | [[shell:qdel 881909.gilgamesh]] |
| 881910.gilgamesh | R | [[shell:qdel 881910.gilgamesh]] |

